{
  "WHAT_WE_BUY": "WHAT WE BUY",
  "ABOUT_US": "ABOUT US",
  "GET_AN_ESTIMATE": "Get An Estimate",
  "Get_a_Quote": "Get a Quote",
  "What_We_Buy": "What We Buy",
  "About_Us": "About Us",
  "CONTACT_US": "CONTACT US",
  "Name": "Name",
  "Company": "Company",
  "Phone_Number": "Phone Number",
  "See_What_We_Buy": "See What We Buy",
  "Email_Address": "Email Address",
  "Last_Name": "Last Name",
  "Message": "Message",
  "Home": "Home",
  "Contact": "Contact",

  "get_a_quote": "GET A QUOTE",
  "what_we_buy": "What We Buy",
  "about_us": "About Us",

  "get_an_estimate": "Get An Estimate",
  "trusted_leader": "Trusted Leader in Recycling since 1963",
  "full_service_company": "We are a full service recycling company specializing in the buying, processing and distribution of ferrous and non-ferrous scrap metals, committed to maintain the highest standard of business ethics and integrity",
  "contact_us": "Contact Us",
  "home_about_us": "HOME – ABOUT US",
  "welcome": "Welcome to Mitch’s Iron & Metal",
  "comprehensive_solutions": "We provide comprehensive scrap metal removal, disposal, and recycling solutions that are specifically tailored to the needs of each client. We are dedicated to the preservation of the environment by making metals recycling both convenient and profitable for Suppliers and Consumers.",
  "50": "50",
  "years": "years of",
  "experience": "experience",
  "home_services": "HOME – SERVICES",
  "high_quality_services": "We provide high-quality services",
  "scrap_management": "Scrap Management",
  "containers_bins_hoppers": "Containers, Tote Bins, and Self Dumping Hoppers",
  "purchase_scrap": "Purchase of Iron and Metal Scrap",
  "see_what_we_buy": "See What We Buy",
  "we_purchase_various_scrap": "We purchase various types of scrap metal…",
  "from_general_public": "From the general public, private contractors, restaurants, hotels, hospitals, and from the manufacturing sector.",
  "services_what_we_buy": "Services – What We Buy",
  "non_ferrous_materials": "Non Ferrous Materials",
  "bare_bright_copper": "Bare Bright Copper",
  "see_detailed_list": "See Detailed List",
  "lead": "Lead",
  "aluminum": "Aluminum",
  "batteries": "Batteries",
  "brass": "Brass",
  "copper": "Copper",
  "stainless_steel": "Stainless Steel",
  "titanium": "Titanium",
  "nickel_alloys": "Nickel Alloys",
  "electric_motors": "Electric Motors",
  "insulated_wire": "Insulated Wire",
  "electronic_scrap": "Electronic Scrap",
  "ferrous_materials": "Ferrous Materials",
  "busheling_steel": "#2 Busheling Steel",
  "plate_structural": "Plate and Structural",
  "heavy_melting_steel": "Heavy Melting Steel",
  "steel_turnings": "Steel Turnings",
  "cast_iron": "Cast Iron",
  "machinery": "Machinery",
  "rebar_steel": "Rebar Steel",
  "demolition_scrap": "Demolition Scrap",
  "pc_boards": "#3 PC Boards",
  "family_business": "We are a family-owned and operated business specializing in scrap metal recycling. The company was founded by Mitchell Goldberg in 1955 and, with his core values of honesty and integrity, he quickly earned the respect of customers and suppliers alike.",
  "about_us_mission": "About Us-Mission",
  "about_us_history": "About Us-History",
  "our_objective": "Our objective at Mitch’s Iron & Metal",
  "objective_description": "We seek to recycle ferrous and non-ferrous materials in a responsible, safe and environmentally sensitive manner while our client’s maximize the value from their recyclable materials. Our goal is to help you maximize the value of your scrap materials. In addition, we pride ourselves on responding to our clients’ service requirements quickly. Fast, reliable and customer-oriented service is the foundation of our operations.",
  "who_we_are": "Who We Are",
  "early_years": "Early Years",
  "early_years_description": "Mitch’s Iron & Metal Ltd. started out with a single Ford dump truck. Mitch worked tirelessly to make a living by picking up scrap metal. He diligently knocked on doors, establishing a legitimate customer base that would enable him to support his family. As the years rolled on, Mitch’s Iron & Metal rapidly grew into a trusted leader in the scrap metal recycling industry.",
  "around_1970": "Around 1970",
  "around_1970_description": "Mitch added the family aspect to the company in 1970 when his daughter Linda joined. Linda quickly learned the ins and outs of the business while working alongside her father. In a short time, Linda took on several roles, including accounting, banking, and sales. By observing her father interact with customers, she quickly picked up Mitch’s shrewd negotiating skills.",
  "in_1985": "In 1985…",
  "in_1985_description": "Mitch’s son, Sydney, joined the company. Under the tutelage of his father, he learned the buying and selling aspects of the business while establishing a rapport with customers and suppliers. With the management of daughter Linda and son Sydney, the company expanded in the following decades.",
  "still_growing": "We are still growing and changing…",
  "still_growing_description": "Now, 50 years later, Mitch’s Iron & Metal is fully operated by brother and sister, Linda and Sydney. We have built a strong reputation through honesty and integrity for our ability to meet and exceed our customers' expectations, and we pride ourselves on forging the strongest bonds between our customers and suppliers. What sets us apart from our competitors is our ability to offer a combination of excellent service while ensuring our customer get maximum value for their scrap.",
  "get_in_touch": "Get in touch",
  "customer_confidence": "Customers are confident when relying on us for efficient and dependable scrap management solutions at competitive pricing. We pride ourselves on responding to our clients’ service requirements only.",
  "Copyright": "Copyright © 2024 Mitch's Iron & Metal",
  "Designed": "Site Designed & Maintained by Blu Creative Digital Technologies",
  "Hard_Drives": "Hard Drives",
  "PC_Boards": "PC Boards",
  "Power_Supplies": "Power Supplies",
  "Servers": "Servers",
  "Hubs_and_Switches": "Hubs and Switches"
}
