{
  "WHAT_WE_BUY": "CE QUE NOUS ACHETONS",
  "ABOUT_US": "À PROPOS DE NOUS",
  "GET_AN_ESTIMATE": "OBTENIR UN DEVIS",
  "Get_a_Quote": "Obtenir un Devis",
  "What_We_Buy": "Ce Que Nous Achetons",
  "Home": "Accueil",
  "About_Us": "À Propos De Nous",
  "Contact": "Contacter",
  "CONTACT_US": "CONTACTEZ-NOUS",
  "Name": "Nom",
  "Last_Name": "Nom De Famille",
  "Email_Address": "Adresse Email",
  "Message": "Message",
  "See_What_We_Buy": "Voir Ce Que Nous Achetons",

  "get_a_quote": "Obtenez un devis",
  "what_we_buy": "Ce que nous achetons",
  "about_us": "À propos de nous",

  "get_an_estimate": "Obtenez une estimation",
  "trusted_leader": "Leader de confiance dans le recyclage depuis 1963",
  "full_service_company": "Nous sommes une entreprise de recyclage offrant des services complets, spécialisée dans l'achat, le traitement et la distribution de métaux ferreux et non ferreux, et nous nous engageons à maintenir les normes les plus élevées d'éthique professionnelle et d'intégrité.",
  "contact_us": "Contactez-nous",
  "home_about_us": "ACCUEIL – À PROPOS DE NOUS",
  "welcome": "Bienvenue chez Mitch's Iron & Metal",
  "comprehensive_solutions": "Nous offrons des solutions complètes de gestion, de mise au rebut et de recyclage des métaux qui sont spécifiquement adaptées aux besoins de chaque client. Nous sommes dédiés à la préservation de l'environnement en rendant le recyclage des métaux à la fois pratique et rentable pour les fournisseurs et les consommateurs.",
  "50": "50",
  "years": "ans",
  "experience": "d'expérience",
  "home_services": "ACCUEIL – SERVICES",
  "high_quality_services": "Nous offrons des services de haute qualité",
  "scrap_management": "Gestion des ferrailles",
  "containers_bins_hoppers": "Conteneurs, bacs à déchets et trémies auto-basculantes",
  "purchase_scrap": "Achat de ferraille et de métaux",
  "see_what_we_buy": "Voir ce que nous achetons",
  "we_purchase_various_scrap": "Nous achetons divers types de ferraille…",
  "from_general_public": "Du grand public, des entrepreneurs privés, des restaurants, des hôtels, des hôpitaux et du secteur manufacturier.",
  "services_what_we_buy": "Services – Ce que nous achetons",
  "non_ferrous_materials": "Matériaux non ferreux",
  "bare_bright_copper": "Cuivre nu brillant",
  "see_detailed_list": "Voir la liste détaillée",
  "lead": "Plomb",
  "aluminum": "Aluminium",
  "batteries": "Batteries",
  "brass": "Laiton",
  "copper": "Cuivre",
  "stainless_steel": "Acier inoxydable",
  "titanium": "Titane",
  "nickel_alloys": "Alliages de nickel",
  "electric_motors": "Moteurs électriques",
  "insulated_wire": "Câbles isolés",
  "electronic_scrap": "Déchets électroniques",
  "ferrous_materials": "Matériaux ferreux",
  "busheling_steel": "#2 Aciers Busheling",
  "plate_structural": "Plaques et structures",
  "heavy_melting_steel": "Aciers lourds à fondre",
  "steel_turnings": "Copeaux d'acier",
  "cast_iron": "Fonte",
  "machinery": "Machinerie",
  "rebar_steel": "Acier d'armature",
  "demolition_scrap": "Ferraille de démolition",
  "pc_boards": "#3 Cartes de circuits imprimés",
  "family_business": "Nous sommes une entreprise familiale spécialisée dans le recyclage de ferraille. L'entreprise a été fondée par Mitchell Goldberg en 1955 et, grâce à ses valeurs fondamentales d'honnêteté et d'intégrité, il a rapidement gagné le respect des clients et des fournisseurs.",
  "about_us_mission": "À propos de nous - Mission",
  "about_us_history": "À propos de nous - Histoire",
  "our_objective": "Notre objectif chez Mitch’s Iron & Metal",
  "objective_description": "Nous nous efforçons de recycler les matériaux ferreux et non ferreux de manière responsable, sécuritaire et respectueuse de l'environnement, tout en permettant à nos clients de maximiser la valeur de leurs matériaux recyclables. Notre objectif est de vous aider à maximiser la valeur de vos matériaux de ferraille. De plus, nous sommes fiers de répondre rapidement aux besoins de nos clients en matière de services. Un service rapide, fiable et axé sur le client est la base de nos opérations.",
  "who_we_are": "Qui nous sommes",
  "early_years": "Les débuts",
  "early_years_description": "Mitch’s Iron & Metal Ltd. a commencé avec un seul camion-benne Ford. Mitch a travaillé sans relâche pour gagner sa vie en ramassant de la ferraille. Il a frappé aux portes avec diligence pour établir une clientèle légitime qui lui permettrait de subvenir aux besoins de sa famille. Au fil des ans, Mitch’s Iron & Metal est rapidement devenu un leader de confiance dans l'industrie du recyclage de ferraille.",
  "around_1970": "Vers 1970",
  "around_1970_description": "Mitch a intégré la dimension familiale à l'entreprise en 1970 lorsque sa fille Linda a rejoint la société. Linda a rapidement appris les tenants et aboutissants du métier en travaillant aux côtés de son père. En peu de temps, Linda a assumé plusieurs rôles, dont la comptabilité, la banque et les ventes. En observant son père traiter avec les clients, elle a rapidement appris les compétences de négociation avisées de Mitch.",
  "in_1985": "En 1985…",
  "in_1985_description": "Le fils de Mitch, Sydney, a rejoint l'entreprise. Sous la tutelle de son père, il a appris les aspects d'achat et de vente du métier tout en établissant un rapport avec les clients et les fournisseurs. Sous la direction de la fille Linda et du fils Sydney, l'entreprise s'est agrandie au cours des décennies suivantes.",
  "still_growing": "Nous continuons à grandir et à évoluer…",
  "still_growing_description": "Aujourd'hui, 50 ans plus tard, Mitch’s Iron & Metal est entièrement dirigé par le frère et la sœur, Linda et Sydney. Nous avons bâti une solide réputation grâce à notre honnêteté et notre intégrité, ainsi qu'à notre capacité à répondre aux attentes de nos clients, voire à les dépasser. Nous sommes fiers de forger des liens solides entre nos clients et nos fournisseurs. Ce qui nous distingue de nos concurrents, c'est notre capacité à offrir un service excellent tout en garantissant à nos clients de maximiser la valeur de leur ferraille.",
  "get_in_touch": "Contactez-nous",
  "customer_confidence": "Nos clients peuvent compter sur nous pour des solutions de gestion de ferraille efficaces et fiables à des prix compétitifs. Nous sommes fiers de répondre uniquement aux besoins de service de nos clients.",
  "Copyright": "Tous droits réservés © 2024 Mitch’s Iron& Metal",
  "Designed": "Site conçu et maintenu par Blu CreativeDigital Technologies",
  "Hard_Drives": "Disques durs",
  "PC_Boards": "Cartes de circuits imprimés",
  "Power_Supplies": "Alimentations électriques",
  "Servers": "Serveurs",
  "Hubs_and_Switches": "Concentrateurs et commutateurs"
}
